Documents/УстановкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаКурсовВалют</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КурсыВалют</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Валюты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/РаботаСВалютами/Ext/Module.bsl
Процедура ЗагрузитьКурсыВалют() Экспорт
	
	HTTPСоединение = Новый HTTPСоединение("www.cbr-xml-daily.ru", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL, Неопределено); 
        
	Заголовки   = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("latest.js", Заголовки);
	
	Попытка
        Результат =  HTTPСоединение.Получить(HTTPЗапрос); 
        Тело = Результат.ПолучитьТелоКакСтроку(); 
       Исключение
         // исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
         Сообщить("Произошла сетевая ошибка!");
         Возврат;
     КонецПопытки;
	 
	ДанныеВалют = JSONВСтруктуру(Тело);
	
	СтруктураВалют = ДанныеВалют.rates;
	
	документОбъект = Документы.УстановкаКурсовВалют.СоздатьДокумент();
	документОбъект.Дата = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого КлючЗначение Из СтруктураВалют Цикл
		
		ВалютаСсылка = Справочники.Валюты.НайтиПоКоду(КлючЗначение.Ключ);
		
		Если ВалютаСсылка = Справочники.Валюты.ПустаяСсылка() Тогда
			ВалютаОбъект = Справочники.Валюты.СоздатьЭлемент();
			ВалютаОбъект.Наименование = КлючЗначение.Ключ;
			ВалютаОбъект.Код = КлючЗначение.Ключ;
			ВалютаОбъект.Записать();
			
			ВалютаСсылка = ВалютаОбъект.Ссылка;
		КонецЕсли;
		
		Стр = документОбъект.Валюты.Добавить();
		Стр.Валюта = ВалютаСсылка;
		Стр.Курс =  ?(КлючЗначение.Значение = 0, 0, 1/КлючЗначение.Значение);
		
	КонецЦикла;

	Попытка
		документОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция JSONВСтруктуру(Знач ОтветСтрока) Экспорт
	
	ЧтениеJSON	= Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСтрока);	
	данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат данные;
	
КонецФункции
